// Задание 1:

// Черепашке нужно забраться на вершину холма. Расстояние от подножия холма до его вершины - 100м.
// Черепашка за день залезает вверх по холму на 50м. Ночью она спит и скатывается на 30м вниз.
// На какие сутки черепашка залезет на столб? Требуется написать код на JS для решения задачи и дать ответ

const validateValue = (value) => {
    return value;
}

const daysToFinishWay = (totalWay) => {

    const lossPerDay = 30;
    let metersPerDay = 50;
    let daysOnTheRoad = 1;

    if(totalWay < 0) {
        return 'Нельзя вводить отрицательные значения';
    } else if(totalWay <= metersPerDay) {
        return daysOnTheRoad;
    }

    const metersPerDayTotal = metersPerDay - lossPerDay;

    do {
        metersPerDay += metersPerDayTotal;
        daysOnTheRoad++;
    } while(metersPerDay < totalWay)
    return daysOnTheRoad;
}
daysToFinishWay(100); // Ответ: Неизвестно на какие сутки черепашка залезет на столб, но на холм залезет на 4 сутки.



// Задание 2:

// В комнате находится человек. Через какое-то время в комнату заходит еще один человек и здоровается с первым. Людей
// в комнате становится 2, а счетчик рукопожатий становится равен 1. Через какое-то время заходит еще один человек и
// здоровается с другими людьми в комнате. Людей в комнате - 3 и счетчик рукопожатий - 3. И т.д. Требуется написать код
// на JS для подсчета кол-ва рукопожатий для 10 человек и дать ответ.

const numberOfHandshakes = (people) => {
    if(people <= 1) {
        return 0;
    }
    return people * (people - 1) / 2;
};
numberOfHandshakes(10); // Ответ: 45 рукопожатий



// Задание 3:

// Есть строка с большим кол-вом слов через запятую (например: "кошка,собака,лошадь,корова,кошка..."). Известно, что
// в строке встречаются повторяющиеся слова. Нужно написать функцию на JS. На вход передаются строка с дублями, а на выходе
// мы получаем строку без дублей.

const removeRepeat = (str) => {
    const makeArr = str.split(',');
    const noRepeatArr = [...new Set(makeArr)];
    return noRepeatArr.join(',');
}

removeRepeat('кошка,собака,лошадь,корова,кошка'); // Вернет: 'кошка,собака,лошадь,корова'


